/*
根据每日 气温 列表，请重新生成一个列表
对应位置的输入是你需要再等待多久温度才会升高超过该日的天数。如果之后都不会升高，请在该位置用 0 来代替。

例如，给定一个列表 temperatures = [73, 74, 75, 71, 69, 72, 76, 73]，你的输出应该是 [1, 1, 4, 2, 1, 1, 0, 0]。

提示：气温 列表长度的范围是 [1, 30000]。每个气温的值的均为华氏度，都是在 [30, 100] 范围内的整数。
*/

/*
[0,  1,  2,  3,  4,  5,  6,  7]
[73, 74, 75, 71, 69, 72, 76, 73]
从后往前
7 空 [[73, 7]] --> 0
6 76 > 73 [[76, 6]] --> 0
5 72 < 76 [[76, 6], [72, 5]] --> 6-5=1
4 69 < 72 [[76, 6], [72, 5], [69, 4]] --> 5-4=1
3 71 > 69, 71 < 72 [[76, 6], [72, 5], [71, 3]] --> 5-3=2
2 75 > 71, 75 > 72, 75 < 76 [[76, 6], [75, 2]] --> 6-2=4
1 74 < 75 [[76, 6], [75, 2], [74, 1]] --> 2-1=1
0 73 < 74 [[76, 6], [75, 2], [74, 1], [73, 0]] --> 1-0=1

[1,1,4,2,1,1,0,0]
*/


/**
 * @param {number[]} T
 * @return {number[]}
 */
var dailyTemperatures = function(T) {
  let ret = []
  let stack = []
  for (let i = T.length - 1; i >= 0; i--) {
    while (stack.length && T[i] >= T[stack[stack.length - 1]]) {
      stack.pop()
    }
    stack.push(i)
    ret.unshift(stack.length === 1 ? 0 : stack[stack.length - 2] - stack[stack.length - 1])
  }
  return ret
};

console.log(dailyTemperatures([73, 74, 75, 71, 69, 72, 76, 73]))
// [1, 1, 4, 2, 1, 1, 0, 0]/

console.log(dailyTemperatures([89,62,70,58,47,47,46,76,100,70]))
// [8,1,5,4,3,2,1,1,0,0]